app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "body", "created_at", "updated_at", "status") VALUES (?, ?, ?, ?, ?)  [["title", "qwerty"], ["body", "qwerty"], ["created_at", "2022-03-16 08:09:17.242412"], ["updated_at", "2022-03-16 08:09:17.242412"], ["status", "public"]]
---
  def create
    @article = Article.new(article_params)

    if @article.save

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "articles" SET "updated_at" = ?, "status" = ? WHERE "articles"."id" = ?  [["updated_at", "2022-03-15 21:49:41.604869"], ["status", "private"], ["id", 5]]
---
  def update
    @article = Article.find(params[:id])

    if @article.update(article_params)

DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 5]]
---
  def destroy
    @article = Article.destroy(params[:id])