app/controllers/comments_controller.rb

  def create
    @article = Article.find(params[:article_id])
    @comment = @article.comments.create(comment_params)
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
INSERT INTO "comments" ("commenter", "body", "article_id", "created_at", "updated_at", "status") VALUES (?, ?, ?, ?, ?, ?)  [["commenter", "Nazar"], ["body", "qwerty"], ["article_id", 5], ["created_at", "2022-03-15 21:49:28.200151"], ["updated_at", "2022-03-15 21:49:28.200151"], ["status", "public"]]